############################################
# 環境変数の設定
############################################
export LANG=ja_JP.UTF-8
export LC_TYPE=ja_JP.UTF-8
export PATH="/usr/local/bin:/usr/local/sbin:/sbin/:$PATH"

############################################
# XDG
############################################
export XDG_CONFIG_HOME="$HOME/.config"

############################################
# Go
############################################
export GOPATH="$HOME/go"
export PATH="$GOPATH/bin:$PATH"

############################################
# Rust
############################################
. "$HOME/.cargo/env"

############################################
# 設定ファイルのエイリアス
############################################
alias zshrc="code $HOME/.zshrc"
alias zshenv="code $HOME/.zshenv"
